Repository: fjgo/Laser4PCB
Catalog: locale/*/LC_MESSAGES/Laser4PCB.po
Languages: es

source: &File
es: &Archivo

source: Open Gerber file
es: Abrir archivo Gerber

source: Open a Gerber file
es: Abrir un archivo Gerber

source: Open ZIP file
es: Abrir archivo ZIP

source: Open a zip file with layers
es: Abre un archivo zip con capas

source: Save .gcode
es: Guardar .gcode

source: Save the generated gcode
es: Guarda el Gcode generado

source: Save image
es: Guardar imagen

source: Save a current view capture
es: Guarda una captura de la vista actual

source: Exit
es: Salir

source: Get out of application
es: Salir de la aplicación

source: &Edit
es: &Editar

source: Preferences
es: Preferencias

source: Open configuration dialog
es: Abrir el diálogo de configuración

source: Set origin
es: Establecer origen

source: Set current position as origin (0,0)
es: Establecer posición actual como origen(0,0)

source: Go to origin
es: Ir a origen

source: Go to origin (0,0)
es: Ir a origen (0,0)

source: Send
es: Enviar

source: Send to engraver
es: Enviar al grabador

source: &Help
es: &Ayuda

source: About
es: Acerca de

source: Application information
es: Información de la aplicación

source: Move up and left(X-, Y+)
es: Mover arriba e izquierda (X-, Y+)

source: Move up(Y+)
es: Mover arriba (Y+)

source: Move up and right(X+, Y+)
es: Mover arriba y derecha (X+, Y+)

source: Move left (X-)
es: Mover izquierda (X-)

source: Stop movement
es: Parar movimiento

source: Move right(X+)
es: Mover derecha (X+)

source: Move down and left (X-, Y-)
es: Mover abajo e izquierda (X-, Y-)

source: Move down (Y-)
es: Mover abajo (Y-)

source: Move down and right (X+, Y-)
es: Mover abajo y derecha (X+, Y-)

source: Set current position as origin(0,0)
es: Establecer posición actual como origen(0,0)

source: Rendering area for Gerber
es: Área de visualización para Gerber

source: Rendering area for GCode
es: Área de visualización para GCode

source: Trace Outline
es: Trazar contorno

source: Fill Interior
es: Rellenar Interior

source: Invert Layer
es: Invertir capa

source: Engraver
es: Grabador

source: Movement
es: Movimiento

source: Log
es: Registro

source: Gerber files
es: Archivos Gerber

source: Top layer
es: Capa superior

source: Bottom layer
es: Capa inferior

source: Top solder mask
es: Máscara de soldadura superior

source: Bottom solder mask
es: Máscara de soldadura inferior

source: Top silkscreen
es: Serigrafía superior

source: Bottom silkscreen
es: Serigrafía inferior

source: Top paste
es: Pasta de soldadura superior

source: Bottom paste
es: Pasta de soldadura inferior

source: Keep-out layer
es: Capa de área restringida

source: Mechanical layers
es: Capas mecánicas

source: Top Pad Master
es: Pads superiores

source: Bottom Pad Master
es: Pads inferiores

source: All files
es: Todos los archivos

source: Selected {num_files} Gerber file: {list_paths}
es: Seleccionado {num_files} archivo Gerber: {list_paths}

source: Error opening Gerber file: {e}
es: Error abriendo archivo Gerber: {e}

source: ZIP files
es: Archivos ZIP

source: Opening ZIP: {pathname}
es: Abriendo ZIP: {pathname}

source: Error opening ZIP file: {e}
es: Error abriendo archivo ZIP: {e}

source: Save GCODE file
es: Guardar archivo GCODE

source: GCODE files
es: Archivo GCODE

source: Saving GCODE in: {pathname}
es: Guardando GCODE en: {pathname}

source: Error saving GCODE file: {e}
es: Error guardando archivo GCODE: {e}

source: PNG Images
es: Imágenes PNG

source: JPG Images
es: Imágenes JPG

source: Saving image in: {pathname}
es: Guardando imagen en: {pathname}

source: Error saving image: {e}
es: Error guardando imagen: {e}

source: Opening configuration
es: Abriendo configuración

source: Updated configuration
es: Configuración actualizada

source: Canceled by the user
es: Cancelado por el usuario

source: An application to generate GCODE from Gerber and send it to a laser engraver.
es: Una aplicación para generar GCODE desde Gerber y enviarlo a un grabador láser.

source: Move head: {command}
es: Moviendo cabezal: {command}

source: Setting origin
es: Estableciendo origen

source: Going to origin
es: Yendo al origen

source: Stopping movement!
es: ¡Parando movimiento!

source: Sending...
es: Enviando...

source: Connection
es: Conexión

source: Open Gerber file Ctrl+G
es: Abrir archivo Gerber Ctrl+G

source: Load .gcode Ctrl+O
es: Cargar .gcode Ctrl+S

source: Load a gcode file
es: Carga un archivo gcode

source: Save .gcode Ctrl+S
es: Guardar .gcode Ctrl+S

source: Exit Ctrl+Q
es: Salir Ctrl+Q

source: Preferences Ctrl+P
es: Preferencias Ctrl+P

source: Set origin Ctrl+R
es: Establecer origen Ctrl+R

source: Go to origin Ctrl+H
es: Ir a origen Ctrl+H

source: Send Ctrl+E
es: Enviar Ctrl+E

source: About F1
es: Acerca de F1

source: Port:
es: Puerto:

source: Speed:
es: Velocidad:

source: Connect
es: Conectar

source: Disconnect
es: Desconectar

source: Move up and left (X-, Y+)
es: Mover arriba e izquierda (X-, Y+)

source: Move up (Y+)
es: Mover arriba (Y+)

source: Move up and right (X+, Y+)
es: Mover arriba y derecha (X+, Y+)

source: Move right (X+)
es: Mover derecha (X+)

source: Load GCODE file
es: Cargar archivo GCODE

source: Loading GCODE from: {pathname}
es: Cargando GCODE de: {pathname}

source: Error loading GCODE file {filename}: {e}
es: Error cargando archivo GCODE {filename}: {e}

source: Error saving GCODE file {filename}: {e}
es: Error guardando archivo GCODE {filename}: {e}

source: An application to generate GCODE from Gerber and send it to a laser engraver.
es: Una aplicación para generar GCODE desde Gerber y enviarlo a un grabador láser.

source: Disconnected.
es: Desconectado.

source: Trying to connect to {port}...
es: Intentando conectar al puerto {port}

source: Connected to {port} at {speed} bps. GRBL ready.
es: Conectado al puerto {port} con velocidad {speed} bps. GRBL listo.

source: The connection to {port} failed.
es: La conexión a {port} falló.

source: Gerber to GCODE converter for laser engraver
es: Conversor Gerber a GCODE para grabadores láser

source: Advance speed (mm/min):
es: Velocidad de avance (mm/min):

source: Speed movement fast (mm/min):
es: Velocidad de movimiento rápido: (mm/min):

source: Laser Power (0-1000):
es: Potencia del Láser (0-1000):

source: Laser Command ON:
es: Comando láser ON:

source: Laser Command OFF:
es: Comando láser OFF:

source: Displacement Distance:
es: Distancia de desplazamiento:

source: Filling Spacing:
es: Espaciado de relleno:

source: Format error in the data. Please ensure to enter valid numbers: {e}
es: Error de formato en los datos. Asegúrese de introducir números válidos: {e}

source: Rendering area
es: Área de visualización
